list_1 = []
list_1 = list()
list_1 = [1, 2, 3, 8]
print(list_1) #если поставить *, то не будут печататься скобки []  и запятые 

for i in list_1:
    print(i) #перебор поочередно переменных

print(len(list_1)) #подсчет количества элементов

print(list_1[0]) #обращение к конкретному элементу списка

print(list_1[-1]) #обращение к последнему элементу списка

list_1 = [1, 5]
print(list_1)
list_1.append(8) #добавить значение в конце к списку

#Удаление последнего элемента списка
list_1 = [12, 7, -1, 21, 0]
print(list_1.pop()) #0

print(list_1.pop(0)) #12

#Добавление элемента на нужную позицию
list_1 = [12, 7, -1, 21, 0]
print(list_1.insert(2, 11)) 
print(list_1) #[12, 7, 11, -1, 21, 0]

#Вывод определенного элемента из списка
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_1[0])                          # 1
print(list_1[1])                          # 2
print(list_1[len(list_1)-1])              # 10
print(list_1[-5])                         # 6
print(list_1[:])                          # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_1[:2])                         # [1, 2]
print(list_1[len(list_1)-2:])             #[9, 10]
print(list_1[2:9])                        # [3, 4, 5, 6, 7, 8, 9]
print(list_1[6:-18])                      # []
print(list_1[0:len(list_1):6])            # [1, 7]
print(list_1[::6])                        # [1, 7]


#КОРТЕЖИ
t = ()

print(type(t))

t = (1,)

